Revit 2024 API
ParameterTypeId.StructuralSectionArea Property
 "Section Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralSectionArea { get; }
Visual Basic
Public Shared ReadOnly Property StructuralSectionArea As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralSectionArea {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace